Repository: SekouDiaoNlp/mlconjug
Catalog: docs/locale/*/LC_MESSAGES/modules.po
Languages: es, ro

source: API Reference for the classes in mlconjug3.mlconjug.py
es: Referencia de API para las clases en mlconjug3.mlconjug.py

source: MLConjug Main module.
es: Módulo principal MLConjug
ro: Modul principal MLConjug.

source: This module declares the main classes the user interacts with.
es: Este módulo declara las principales clases con las que el usuario interactúa"
ro: Acest modul declară clasele principale cu care interacționează utilizatorul.

source: The module defines the classes needed to interface with Machine Learning models.
es: El módulo define las clases necesarias para interactuar con los modelos de Machine Learning"
ro: Modulul definește clasele necesare pentru a interconecta cu modelele Machine Learning.

source: Custom Vectorizer optimized for extracting verbs features.
es: Vectorizador personalizado optimizado para extraer las características de los verbos"
ro: Vectorizatorul personalizat optimizat pentru extragerea caracteristicilor verbelor.

source: The Vectorizer subclasses sklearn.feature_extraction.text.CountVectorizer .
es: Las subclases Vectorizer sklearn.feature_extraction.text.CountVectorizer"
ro: Subclasele Vectorizer sklearn.feature_extraction.text.CountVectorizer.

source: As in Indo-European languages verbs are inflected by adding a morphological suffix, the vectorizer extracts verb endings and produces a vector representation of the verb with binary features.
es: el vectorizador extrae las terminaciones de los verbos y produce una representación vectorial del verbo con características binarias

source: To enhance the results of the feature extration, several other features have been included:
es: Para mejorar los resultados de la extracción de características, se han incluido varias otras características:
ro: Pentru a îmbunătăți rezultatele extragerii de elemente, au fost incluse și alte caracteristici:

source: The features are the verb's ending n-grams, starting n-grams, length of the verb, number of vowels, number of consonants and the ratio of vowels over consonants.
es: Las características son los n-gramas finales del verbo, los n-grams iniciales, la longitud del verbo, el número de vocales, el número de consonantes y la proporción de vocales sobre consonantes.
ro: Caracteristicile sunt n-gramele de nobile ale notelor, începând n-grame, lungimea verbului, numărul de vocale, numărul de consoane și raportul dintre vocale pe consoane.

source: Parameters
es: Parámetros
ro: Parametri

source: string. Verb to vectorize.
es: string. Verbo para vectorizar
ro: șir. Verb să vectorizeze.

source: string. Language to analyze.
es: string. Idioma para analizar.

source: tuple. The range of the ngram sliding window.
es: tupla El rango de la ventana deslizante ngram.
ro: tuplu. Intervalul ferestrei glisante ngram.

source: Returns
es: Devoluciones
ro: Se intoarce

source: list. List of the most salient features of the verb for the task of finding it's conjugation's class.
es: list. Lista de las características más destacadas del verbo para la tarea de encontrar su clase de conjugación.
ro: listă. Lista celor mai importante trăsături ale verbului pentru sarcina de a găsi clasa lui de conjugare.

source: Bases: :class:`object`
es: Bases:: clase:` objeto`
ro: Bazele:: clasa:` obiect`

source: This is the main class of the project.
es: Esta es la clase principal del Proyecto.
ro: Aceasta este clasa principală a proiectului.

source: The class manages the Verbiste data set and provides an interface with the scikit-learn pipeline.
es: La clase maneja el conjunto de datos Verbiste y proporciona una interfaz con el modelo scikit-learn.

source: If no parameters are provided, the default language is set to french and the pre-trained french conjugation pipeline is used.
es: Si no se proporcionan parámetros, el idioma predeterminado es francés y se utiliza el modelo de conjugación francés preentrenado.

source: The class defines the method conjugate(verb, language) which is the main method of the module.
es: La clase define el método conjugado (verbo, lenguaje) que es el método principal del modulo.
ro: Clasa definește metoda conjugată (verb, limbă) care este principala metodă a modulului.

source: string. Language of the conjugator. The default language is 'fr' for french.
es: string. Idioma del conjugador. El idioma predeterminado es 'fr' para francés.
ro: Limbajul conjugatorului. Limba implicită este" fr "pentru franceză.

source: mlconjug3.Model or scikit-learn Pipeline or Classifier implementing the fit() and predict() methods. A user provided pipeline if the user has trained his own pipeline.
es: mlconjug3.Model o scikit-learn Pipeline o Classifier implementando los métodos fit () y predict (). Un conducto proporcionado por el usuario si el usuario ha entrenado su propia tubería.
ro: mlconjug3.Model sau scikit-learn Pipeline sau Classifier implementând metodele fit () și predictive (). O conductă furnizată de utilizator în cazul în care utilizatorul și-a pregătit propria conductă.

source: This is the main method of this class.
es: Este es el método principal de esta clase.
ro: Aceasta este principala metodă a acestei clase.

source: It first checks to see if the verb is in Verbiste.
es: Primero verifica si el verbo está en Verbiste.
ro: Mai întâi verifică dacă verbul este în Verbiste"

source: If it is not, and a pre-trained scikit-learn pipeline has been supplied, the method then calls the pipeline to predict the conjugation class of the provided verb.
es: Si no es así, y se ha proporcionado un modelo de aprendizaje de scikit preentrenado, el método llama al modelo.

source: Returns a Verb object or None.
es: Devuelve un objeto Verb o Ninguno.
ro: Returnează un obiect Verb sau Nici unul.

source: string. Verb to conjugate.
es: string. Verbo para conjugar.
ro: șir. Verbul să conjugați.

source: string. Toggles abbreviated or full pronouns. The default value is 'abbrev'. Select 'pronoun' for full pronouns.
es: string. Alterna los pronombres abreviados o completos. El valor predeterminado es 'abreviación'. Seleccione 'pronombre' para los pronombres completos.
ro: string" ("string"), controlează denumirile abreviate sau complet, valoarea implicită este "abbrev"

source: Assigns the provided pre-trained scikit-learn pipeline to be able to conjugate unknown verbs.
es: Asigna el modelo de aprendizaje de scikit preentrenado provisto para poder conjugar verbos desconocidos.

source: scikit-learn Classifier or Pipeline.
es: scikit-learn Classifier o Pipeline"
ro: clasificator sau conducte scikit-learn"

source: This class holds and manages the data set.
es: Esta clase contiene y administra el conjunto de datos"
ro: Această clasă deține și gestionează setul de date.

source: Defines helper methodss for managing Machine Learning tasks like constructing a training and testing set.
es: Define funciones auxiliares para administrar tareas de Aprendizaje automático, como la construcción de un conjunto de entrenamiento y prueba.

source: A dictionary of verbs and their corresponding conjugation class.
es: Un diccionario de verbos y su correspondiente clase de conjugación.
ro: Un dicționar de verbe și clasa lor de conjugare corespunzătoare.

source: Populates the dictionary containing the conjugation templates.
es: Rellena el diccionario que contiene las plantillas de conjugación.
ro: Populează dicționarul care conține șabloanele de conjugare.

source: Populates the lists containing the verbs and their templates.
es: Rellena las listas que contienen los verbos y sus plantillas.
ro: Populează listele care conțin verbele și șabloanele lor"

source: Splits the data into a training and a testing set.
es: Divide los datos en un conjunto de entrenamiento y prueba.
ro: Împărțiți datele într-un antrenament și un set de testare.

source: int. Minimum size of conjugation class to be split.
es: int. Tamaño mínimo de la clase de conjugación que se dividirá.
ro: int Dimensiunea minimă a clasei de conjugare care trebuie divizată.

source: float. Proportion of samples in the training set. Must be between 0 and 1.
es: float. Proporción de muestras en el conjunto de entrenamiento. Debe estar entre 0 y 1.
ro: float" Proporția probelor din setul de antrenament trebuie să fie între 0 și 1.

source: This class manages the scikit-learn pipeline.
es: Esta clase maneja el modelo scikit-learn.

source: The Pipeline includes a feature vectorizer, a feature selector and a classifier.
es: The Pipeline incluye un vectorizador de funciones, un selector de funciones y un clasificador"
ro: Conducta include un vectorizator de caracteristici, un selector de caracteristici și un clasificator.

source: If any of the vectorizer, feature selector or classifier is not supplied at instance declaration, the __init__ method will provide good default values that get more than 92% prediction accuracy.
es: El método __init__ proporcionará buenos valores predeterminados que obtienen más del 92% de precisión de predicción.

source: scikit-learn Classifier with a fit_transform() method
es: clasificador scikit-learn con un método fit_transform ()
ro: clasificator scikit-learn cu o metodă fit_transform ()

source: scikit-learn Classifier with a predict() method
es: clasificador scikit-learn con un método de predicción ()
ro: clasificator Scikit-learn cu o metodă predictivă ()

source: language of the corpus of verbs to be analyzed.
es: lenguaje del corpus de verbos a analizar.
ro: limbajul corpusului de verbe care urmează să fie analizat.

source: Trains the pipeline on the supplied samples and labels.
es: Entrena el modelo en las muestras y etiquetas suministradas.

source: list. List of verbs.
es: lista. Lista de verbos.
ro: ista de verbe.

source: list. List of verb templates.
es: lista. Lista de plantillas de verbos.
ro: Listă de șabloane de verb.

source: Predicts the conjugation class of the provided list of verbs.
es: Predice la clase de conjugación de la lista de verbos proporcionada.
ro: Prezice clasa de conjugare a listei furnizate de verbe"

source: list. List of predicted conjugation groups.
es: lista. Lista de grupos de conjugación predichos.
ro: ista de grupuri prezise de conjugare.

source: API Reference for the classes in mlconjug3.PyVerbiste.py
es: Referencia de API para las clases en mlconjug3.PyVerbiste.py
ro: Referință API pentru clasele din mlconjug3.PyVerbiste.py

source: A Python library for conjugating verbs in French, English, Spanish, Italian, Portuguese and Romanian (more soon).
es: Una biblioteca de Python para conjugar verbos en francés, inglés, español, italiano, portugués y rumano (más pronto).
ro: O bibliotecă Python pentru conjugarea verbelor în franceză, engleză, spaniolă, italiană, portugheză și română (mai curând)"

source: It contains conjugation data generated by machine learning models using the python library mlconjug3.
es: Contiene datos de conjugación generados por modelos de aprendizaje automático utilizando la biblioteca de python mlconjug3.
ro: Acesta conține date de conjugare generate de modelele de învățare mecanică folosind librăria python mlconjug3.

source: More information about mlconjug3 at https://pypi.org/project/mlconjug3/
es: Más información sobre mlconjug3 en https://pypi.org/project/mlconjug3/
ro: Mai multe informații despre mlconjug3 la adresa https://pypi.org/project/mlconjug3/

source: The conjugation data conforms to the XML schema defined by Verbiste.
es: Los datos de conjugación se ajustan al esquema XML definido por Verbiste.
ro: Datele de conjugare sunt conforme cu schema XML definită de Verbiste.

source: More information on Verbiste at https://perso.b2b2c.ca/~sarrazip/dev/conjug_manager.html
es: Más información sobre Verbiste en https://perso.b2b2c.ca/~sarrazip/dev/conjug_manager.html
ro: Mai multe informații despre Verbiste la adresa https://perso.b2b2c.ca/~sarrazip/dev/conjug_manager.html

source: This is the class handling the mlconjug3 json files.
es: Esta es la clase que maneja los archivos json.

source: string. | The language of the conjugator. The default value is fr for French. | The allowed values are: fr, en, es, it, pt, ro.
es: string. | Idioma del conjugador. El idioma predeterminado es 'fr' para francés.

source: Load and parses the verbs from the json file.
es: Cargar y analizar los verbos del archivo json.

source: string or path object. Path to the verbs json file.
es: string o objeto de ruta. Ruta al archivo json de verbos.

source: Load and parses the conjugations from the xml file.
es: Cargar y analizar las conjugaciones del archivo json.

source: string or path object. Path to the conjugation xml file.
es: string o objeto de ruta. Ruta al archivo xml de conjugación
ro: șir sau obiect cale. Calea spre fișierul xml de conjugare.

source: Detects the allowed endings for verbs in the supported languages.
es: Detecta las terminaciones permitidas para los verbos en los idiomas admitidos
ro: Detectează terminațiile permise pentru verbe în limbile acceptate.

source: All the supported languages except for English restrict the form a verb can take.
es: Todos los idiomas admitidos, excepto el inglés, restringen la forma que puede adoptar un verbo
ro: Toate limbile acceptate, cu excepția limbii engleze, restricționează forma pe care o poate lua un verb"

source: As English is much more productive and varied in the morphology of its verbs, any word is allowed as a verb.
es: Como el inglés es mucho más productivo y variado en la morfología de sus verbos, cualquier palabra se permite como verbo
ro: Deoarece engleza este mult mai productivă și mai variată în morfologia verbelor ei, orice cuvânt este permis ca verb"

source: set. A set containing the allowed endings of verbs in the target language.
es: set. Un conjunto que contiene las terminaciones permitidas de los verbos en el idioma de destino
ro: un set care conține terminațiile permise ale verbelor în limba țintă.

source: Checks if the verb is a valid verb in the given language.
es: Comprueba si el verbo es un verbo válido en el idioma dado.
ro: Verifică dacă verbul este un verb valabil în limba dată.

source: English words are always treated as possible verbs.
es: Las palabras en inglés siempre se tratan como posibles verbos.
ro: Cuvintele în limba engleză sunt tratate întotdeauna ca verbe posibile.

source: Verbs in other languages are filtered by their endings.
es: Los verbos en otros idiomas se filtran por sus terminaciones.
ro: Verbe în alte limbi sunt filtrate după terminările lor.

source: string. The verb to conjugate.
es: string. El verbo conjugar
ro: Verbul de a conjuga.

source: bool. True if the verb is a valid verb in the language. False otherwise.
es: bool. Verdadero si el verbo es un verbo válido en el idioma. De lo contrario, falso"
ro: Adevărat dacă verbul este un verb valabil în limba respectivă

source: Gets verb information and returns a VerbInfo instance.
es: Obtiene información del verbo y devuelve una instancia de VerbInfo"
ro: Obține informații verbale și returnează o instanță VerbInfo.

source: VerbInfo object or None.
es: Objeto VerbInfo o Ninguno"
ro: Obiect VerbInfo sau Nici unul.

source: Gets conjugation information corresponding to the given template.
es: Obtiene la información de conjugación correspondiente a la plantilla dada"
ro: Obține informații de conjugare corespunzătoare șablonului dat.

source: string. Name of the verb ending pattern.
es: string. Nombre del patrón de terminación del verbo"
ro: șir. Numele verbului care se termină.

source: OrderedDict or None. OrderedDict containing the conjugated suffixes of the template.
es: OrderedDict or None. OrderedDict que contiene los sufijos conjugados de la plantilla"
ro: OrdonatDict sau Nici unul. OrdonatDict care conține sufixele conjugate ale șablonului.

source: This is the class handling the Verbiste xml files.
es: Esta es la clase que maneja los archivos Verbiste xml"
ro: Aceasta este clasa care gestionează fișierele xml Verbiste.

source: Load and parses the verbs from the xml file.
es: Cargar y analizar los verbos del archivo xml"

source: string or path object. Path to the verbs xml file.
es: cadena o objeto de ruta. Ruta al archivo xml de verbos"
ro: șir sau obiect cale. Calea spre fișierul xml verbale.

source: Parses the XML file.
es: Analiza el archivo XML"

source: FileObject. XML file containing the verbs.
es: FileObject. Archivo XML que contiene los verbos"
ro: Fișier XML conținând verbele"

source: OrderedDict. An OrderedDict containing the verb and its template for all verbs in the file.
es: OrderedDict. Un OrderedDict que contiene el verbo y su plantilla para todos los verbos en el archivo"
ro: OrderedDict Un ordin ordonat care conține verbul și șablonul său pentru toate verbele din fișier.

source: FileObject. XML file containing the conjugation templates.
es: FileObject. Archivo XML que contiene las plantillas de conjugación"
ro: FileObject, fișier XML care conține șabloanele de conjugare.

source: OrderedDict. An OrderedDict containing all the conjugation templates in the file.
es: OrderedDict. Un OrderedDict que contiene todas las plantillas de conjugación en el archivo"
ro: OrderedDict: Un ordin ordonat care conține toate șabloanele de conjugare din fișier.

source: Load and parses the inflected forms of the tense from xml file.
es: Cargar y analizar las formas del tiempo inflexión del archivo xml"
ro: Încarcă și analizează formele inflexionate ale timpului din fișierul xml.

source: list of xml tags containing inflected forms. The list of inflected forms for the current tense being processed.
es: lista de etiquetas xml que contienen formas flexionadas La lista de formas declinadas para el tiempo actual que se está procesando.
ro: listă de etichete xml care conțin formulare inflexionate. Lista formelor inflexionate pentru procesarea momentului curent.

source: list. List of inflected forms.
es: lista. Lista de formas declinadas.

source: This class defines the Verbiste verb information structure.
es: Esta clase define la estructura de información del verbo Verbiste"
ro: Această clasă definește structura de informații conjug_manager Verbiste.

source: string. Infinitive form of the verb.
es: cadena. Forma infinitiva del verbo"
ro: șir. Formă infinitivă a verbului.

source: string. Lexical root of the verb.
es: cadena. Raíz léxica del verbo"
ro: rădăcină. Rădăcina lexicală a verbului"

source: This class defines the Verb Object.
es: Esta clase define el Objeto Verbo"
ro: Această clasă definește obiectul Verb"

source: VerbInfo Object.
es: Objeto VerbInfo"
ro: Obiectul VerbInfo.

source: bool. Indicates if the conjugation information was predicted by the model or retrieved from the dataset.
es: bool. Indica si la información de conjugación fue predicha por el modelo o recuperada del conjunto de datos.
ro: bool. Indică dacă informațiile despre conjugare au fost prezise de model sau au fost extrase din setul de date.

source: Populates the inflected forms of the verb.
es: Rellena las formas flexionadas del verbo"
ro: Populează formele inflaționate ale verbului"

source: This is the generic version of this method.
es: Esta es la versión genérica de este método"
ro: Aceasta este versiunea generică a acestei metode.

source: It does not add personal pronouns to the conjugated forms.
es: No agrega pronombres personales a las formas conjugadas"
ro: Nu adaugă pronume personale forțelor conjugate"

source: This method can handle any new language if the conjugation structure conforms to the Verbiste XML Schema.
es: Este método puede manejar cualquier idioma nuevo si la estructura de conjugación se ajusta al esquema XML de Verbiste"
ro: Această metodă se poate ocupa de orice limbă nouă, dacă structura de conjugare este conformă cu Schema XML Verbiste"

source: Bases: :class:`mlconjug3.PyVerbiste.Verb`
es: Bases:: clase:` mlconjug3.PyVerbiste.Verb`
ro: Bazele:: clasa:" mlconjug3.PyVerbiste.Verb`

source: This class defines the French Verb Object.
es: Esta clase define el objeto del verbo francés"
ro: Această clasă definește obiectul verbal francez.

source: Adds personal pronouns to the inflected verbs.
es: Agrega pronombres personales a los verbos inflexionados"
ro: Adăugă pronume personale la verbele inflaționate.

source: This class defines the English Verb Object.
es: Esta clase define el objeto del verbo inglés"
ro: Această clasă definește Obiectul englez de verb.

source: This class defines the Spanish Verb Object.
es: Esta clase define el objeto del verbo español"
ro: Această clasă definește Obiectul verbului spaniol.

source: This class defines the Italian Verb Object.
es: Esta clase define el objeto del verbo italiano"
ro: Această clasă definește obiectul verbului italian"

source: This class defines the Portuguese Verb Object.
es: Esta clase define el objeto del verbo portugués"
ro: Această clasă definește obiectul verbului portughez.

source: This class defines the Romanian Verb Object.
es: Esta clase define el objeto del verbo rumano"
ro: Această clasă definește obiectul verbului românesc"

source: Package Api Documentation for mlconjug3
ro: Pachetul Api Documentația pentru mlconjug3

source: API Reference for the classes in mlconjug3.mlconjug3.py
ro: Referință API pentru clasele din mlconjug3.mlconjug3.py

source: Verb object or None.
ro: Obiect Verb sau Niciunul.
